Ran Plan for 2 projects:

1. project: `Network` dir: `01_VPC` workspace: `default`
1. project: `ECS-Cluster` dir: `02_ECS_CLUSTER` workspace: `default`
---

### 1. project: `Network` dir: `01_VPC` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_route.private_access["private_subnet_1a"] will be updated in-place
~ resource "aws_route" "private_access" {
      + gateway_id                  = "nat-0a15018219f61243e"
        id                          = "r-rtb-0749f8a131ee500a31080289494"
      - nat_gateway_id              = "nat-0a15018219f61243e" -> null
        # (16 unchanged attributes hidden)
    }

  # aws_route.private_access["private_subnet_1b"] will be updated in-place
~ resource "aws_route" "private_access" {
      + gateway_id                  = "nat-0d96f3990157a8eef"
        id                          = "r-rtb-0ed8ee4e8dff679081080289494"
      - nat_gateway_id              = "nat-0d96f3990157a8eef" -> null
        # (16 unchanged attributes hidden)
    }

  # aws_route.private_access["private_subnet_1c"] will be updated in-place
~ resource "aws_route" "private_access" {
      + gateway_id                  = "nat-0046fcf644a147a7e"
        id                          = "r-rtb-01eaa5cdc5bc94d881080289494"
      - nat_gateway_id              = "nat-0046fcf644a147a7e" -> null
        # (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p Network
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.ricardinho.synology.me/lock?id=ricardosilva86%252FArquitetura-Containers-AWS%252F01_VPC%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p Network
  ```
Plan: 0 to add, 3 to change, 0 to destroy.

---
### 2. project: `ECS-Cluster` dir: `02_ECS_CLUSTER` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_ssm_parameter.public_subnet_1c: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.private_subnet_1c: Reading...
data.aws_ssm_parameter.public_subnet_1b: Reading...
data.aws_ssm_parameter.private_subnet_1b: Reading...
data.aws_ssm_parameter.public_subnet_1a: Reading...
data.aws_ssm_parameter.database_subnet_1c: Reading...
data.aws_ssm_parameter.database_subnet_1b: Reading...
data.aws_ssm_parameter.database_subnet_1a: Reading...
data.aws_ssm_parameter.private_subnet_1a: Reading...
data.aws_ssm_parameter.database_subnet_1c: Read complete after 0s [id=/linuxtips-aca/vpc/database-subnet-1c]
data.aws_ssm_parameter.public_subnet_1a: Read complete after 0s [id=/linuxtips-aca/vpc/public-subnet-1a]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/linuxtips-aca/vpc/vpc-id]
data.aws_ssm_parameter.private_subnet_1b: Read complete after 0s [id=/linuxtips-aca/vpc/private-subnet-1b]
data.aws_ssm_parameter.database_subnet_1b: Read complete after 0s [id=/linuxtips-aca/vpc/database-subnet-1b]
data.aws_ssm_parameter.public_subnet_1b: Read complete after 0s [id=/linuxtips-aca/vpc/public-subnet-1b]
data.aws_ssm_parameter.private_subnet_1c: Read complete after 0s [id=/linuxtips-aca/vpc/private-subnet-1c]
data.aws_ssm_parameter.public_subnet_1c: Read complete after 0s [id=/linuxtips-aca/vpc/public-subnet-1c]
data.aws_ssm_parameter.database_subnet_1a: Read complete after 0s [id=/linuxtips-aca/vpc/database-subnet-1a]
data.aws_ssm_parameter.private_subnet_1a: Read complete after 0s [id=/linuxtips-aca/vpc/private-subnet-1a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_autoscaling_group.main["on_demand"] will be created
+ resource "aws_autoscaling_group" "main" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 3
      + enabled_metrics                  = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "linuxtips-ecs-cluster-on_demand"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (sensitive value)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "linuxtips-ecs-cluster-on-demand"
        }

      + traffic_source (known after apply)
    }

  # aws_autoscaling_group.main["spots"] will be created
+ resource "aws_autoscaling_group" "main" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 3
      + enabled_metrics                  = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "linuxtips-ecs-cluster-spots"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (sensitive value)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "linuxtips-ecs-cluster-on-demand"
        }

      + traffic_source (known after apply)
    }

  # aws_ecs_capacity_provider.main["on_demand"] will be created
+ resource "aws_ecs_capacity_provider" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "linuxtips-ecs-cluster-on_demand"
      + tags     = {
          + "Name" = "linuxtips-ecs-cluster-on-demand"
        }
      + tags_all = {
          + "Name" = "linuxtips-ecs-cluster-on-demand"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = (known after apply)
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 10
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 90
            }
        }
    }

  # aws_ecs_capacity_provider.main["spots"] will be created
+ resource "aws_ecs_capacity_provider" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "linuxtips-ecs-cluster-spots"
      + tags     = {
          + "Name" = "linuxtips-ecs-cluster-on-demand"
        }
      + tags_all = {
          + "Name" = "linuxtips-ecs-cluster-on-demand"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = (known after apply)
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 10
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 90
            }
        }
    }

  # aws_ecs_cluster.main will be created
+ resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "linuxtips-ecs-cluster"
      + tags     = {
          + "Name" = "linuxtips-ecs-cluster"
        }
      + tags_all = {
          + "Name" = "linuxtips-ecs-cluster"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.main["on_demand"] will be created
+ resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "linuxtips-ecs-cluster-on_demand",
        ]
      + cluster_name       = "linuxtips-ecs-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "linuxtips-ecs-cluster-on_demand"
          + weight            = 100
        }
    }

  # aws_ecs_cluster_capacity_providers.main["spots"] will be created
+ resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "linuxtips-ecs-cluster-spots",
        ]
      + cluster_name       = "linuxtips-ecs-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "linuxtips-ecs-cluster-spots"
          + weight            = 100
        }
    }

  # aws_iam_instance_profile.main will be created
+ resource "aws_iam_instance_profile" "main" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "linuxtips-ecs-cluster-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "linuxtips-ecs-cluster-instance-profile"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.main will be created
+ resource "aws_iam_role" "main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "linuxtips-ecs-cluster-instance-profile"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ec2_role will be created
+ resource "aws_iam_role_policy_attachment" "ec2_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "linuxtips-ecs-cluster-instance-profile"
    }

  # aws_iam_role_policy_attachment.ec2_ssm will be created
+ resource "aws_iam_role_policy_attachment" "ec2_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM"
      + role       = "linuxtips-ecs-cluster-instance-profile"
    }

  # aws_launch_template.main["on_demand"] will be created
+ resource "aws_launch_template" "main" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-087925fac10d4c4f1"
      + instance_type          = "t3a.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "linuxtips-ecs-cluster-on_demand"
      + tags_all               = (known after apply)
      + update_default_version = true
      + user_data              = "IyEvYmluL2Jhc2gKZWNobyBFQ1NfQ0xVU1RFUj1saW51eHRpcHMtZWNzLWNsdXN0ZXIgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZw=="
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 30
              + volume_type = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "linuxtips-ecs-cluster-instance-profile"
        }

      + instance_market_options {
          + spot_options {
              + valid_until = (known after apply)
            }
        }

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "linuxtips-ecs-cluster-on-demand"
            }
        }
    }

  # aws_launch_template.main["spots"] will be created
+ resource "aws_launch_template" "main" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-087925fac10d4c4f1"
      + instance_type          = "t3a.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "linuxtips-ecs-cluster-spots"
      + tags_all               = (known after apply)
      + update_default_version = true
      + user_data              = "IyEvYmluL2Jhc2gKZWNobyBFQ1NfQ0xVU1RFUj1saW51eHRpcHMtZWNzLWNsdXN0ZXIgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZw=="
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 30
              + volume_type = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "linuxtips-ecs-cluster-instance-profile"
        }

      + instance_market_options {
          + market_type = "spot"

          + spot_options {
              + max_price   = "0.15"
              + valid_until = (known after apply)
            }
        }

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "linuxtips-ecs-cluster-on-demand"
            }
        }
    }

  # aws_lb.main will be created
+ resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "linuxtips-ecs-cluster-ingress"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (sensitive value)
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.main will be created
+ resource "aws_lb_listener" "main" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "ACA LinuxTips"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # aws_security_group.lb will be created
+ resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "linuxtips-ecs-cluster-loadbalancer"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (sensitive value)
    }

  # aws_security_group.main will be created
+ resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "linuxtips-ecs-cluster-vpc-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (sensitive value)
    }

  # aws_security_group_rule.ingress will be created
+ resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.subnet_ranges will be created
+ resource "aws_security_group_rule" "subnet_ranges" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow all traffic within the VPC"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # aws_ssm_parameter.lobalancer_arn will be created
+ resource "aws_ssm_parameter" "lobalancer_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/linuxtips-ecs-cluster/ecs/loadbalancer/arn"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.lobalancer_dns_name will be created
+ resource "aws_ssm_parameter" "lobalancer_dns_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/linuxtips-ecs-cluster/ecs/loadbalancer/dns-name"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.lobalancer_id will be created
+ resource "aws_ssm_parameter" "lobalancer_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/linuxtips-ecs-cluster/ecs/loadbalancer/id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ loadbalancer_dns_name = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p ECS-Cluster
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.ricardinho.synology.me/lock?id=ricardosilva86%252FArquitetura-Containers-AWS%252F02_ECS_CLUSTER%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p ECS-Cluster
  ```
Plan: 22 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```